Tekla Open API Reference for Tekla Structures 2025
LoadTemperature.TemperatureDifferentialSideToSide Property
 Gets or sets the temperature differential from side to side.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double TemperatureDifferentialSideToSide { get; set; }
Public Property TemperatureDifferentialSideToSide As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
LoadTemperature Class
Tekla.Structures.Model Namespace